
#include "service.h"


// Провести одну итерацию	
Triangle* calculate_one_iteration(Triangle* triangles, double curve_coefficient){
	// Создаем результирующий массив треугольников, по величине в 3 раза больший, чем исходный
	// Бежим по каждому треугольнику и для него создаем три новых по треубемой формуле
	// Возвращаем результирующий массив треугольников
	return 0;
}



// Провести все итерации
Triangle* calculate_all(Screen screen, int iteration_count, double curve_coefficient){
	// Создать экран по введенной пользователем ширине и длине
	// Создать треугольник базовый
	// Проводить итерации пока не закончится количество итераций
	// Отрисовать треугольники (вывести координаты)
	return 0;
}
